Repository: jmdaweb/devguides_translation
Catalog: translations/*/LC_MESSAGES/CODE_OF_CONDUCT.po
Languages: es

source: # Citizen and Contributor Code of Conduct
es: # Código de conducta del ciudadano y el colaborador

source: ## 1. Purpose
es: ## 1. Propósito

source: A primary goal of NV Access and NVDA is to be inclusive to the largest number of contributors, with the most varied and diverse backgrounds possible. As such, we are committed to providing a friendly, safe and welcoming environment for all, regardless of gender, sexual orientation, ability, ethnicity, nationality, socioeconomic status, education, level of experience and religion (or lack thereof).
es: Uno de los principales objetivos de NV Access y NVDA es ser inclusivo con el mayor número posible de colaboradores, con la mayor variedad y diversidad posible de contextos. Por lo tanto, estamos comprometidos a proporcionar un entorno amigable, acogedor y seguro para todos, sin importar su género, orientación sexual, discapacidad, etnia, nacionalidad, estado socioeconómico, educación, nivel de experiencia y religión (o falta de ella).

source: This code of conduct outlines our expectations for all those who participate in our community, as well as the consequences for unacceptable behaviour.
es: Este código de conducta describe nuestras expectativas para todos aquellos que participen en nuestra comunidad, así como las consecuencias de los comportamientos inaceptables.

source: We invite all those who participate in the NVDA community to help us create safe and positive experiences for everyone. NVDA is a user driven initiative.
es: Invitamos a todos aquellos que participan en la comunidad de NVDA a que nos ayuden a crear experiencias seguras y positivas para todos. NVDA es una iniciativa dirigida por el usuario.

source: ## 2. Open Source Citizenship
es: ## 2. Ciudadanía de código abierto

source: A supplemental goal of this Code of Conduct is to increase open source citizenship by encouraging participants to recognise and strengthen the relationships between our actions and their effects on our community.
es: Un objetivo suplementario de este código de conducta es incrementar la ciudadanía de código abierto fomentando a los participantes a reconocer y fortalecer las relaciones entre nuestras acciones y sus efectos en la comunidad.

source: Communities mirror the societies in which they exist and positive action is essential to counteract the many forms of inequality and abuses of power that exist in society.
es: Las comunidades reflejan las sociedades en las que existen, y la acción positiva es esencial para contrarrestar la multitud de formas de desigualdad y abusos de poder existentes en la sociedad.

source: If you see someone who is making an extra effort to ensure our community is welcoming, friendly, and encourages all participants to contribute to the fullest extent, we want to know.
es: Si conoces a alguien que lleve a cabo un esfuerzo extra para garantizar que nuestra comunidad es acogedora, amigable, y fomenta la colaboración de los participantes en toda su extensión, queremos saberlo.

source: ## 3. Expected Behaviour
es: ## 3. Comportamientos esperados

source: The following behaviours are expected and requested of all community members:
es: Se esperan y solicitan los siguientes comportamientos por parte de todos los miembros de la comunidad:

source: * To participate in an authentic and active way. In doing so, you contribute to the health and longevity of this community.
es: * Participar de una manera auténtica y activa. Al hacerlo, contribuyes con la salud y longevidad de esta comunidad.

source: * To exercise consideration and respect in your speech and actions.
es: * Ejercitar la consideración y el respeto en tu discurso y tus acciones.

source: * To attempt collaboration before conflict.
es: * Intentar la colaboración antes que el conflicto.

source: * To provide helpful contributions to an issue in order to encourage its progression
es: * Proporcionar contribuciones útiles a una incidencia para fomentar su progreso

source: * To be respectful of differing viewpoints and experiences
es: * Ser respetuoso con las experiencias y puntos de vista diferentes

source: * To gracefully accept constructive criticism
es: * Aceptar de buen grado las críticas constructivas

source: * To respect the need to prioritise issues based on NV Access, user, and community priority
es: * Respetar la necesidad de priorizar incidencias basadas en NV Access, el usuario, y la comunidad

source: * To be aware that GitHub is a public forum and refrain from publishing personal or sensitive information (your own or others). For example, carefully consider the contents of debug logs when publishing.
es: * Ser consciente de que GitHub es un foro público y abstenerse de publicar información personal o sensible (tuya o de otros). Estudia con mucho cuidado el contenido de los registros de depuración antes de publicarlos.

source: * To refrain from demeaning, discriminatory, or harassing behaviour and speech.
es: * Abstenerse de discursos y comportamientos degradantes, acosadores o discriminatorios.

source: * To be mindful of your surroundings and of your fellow participants. Alert NV Access staff if you notice a dangerous situation, someone in distress, or violations of this Code of Conduct, even if they seem inconsequential.
es: * Ser consciente de tu entorno y de los demás participantes. Alerta al equipo de NV Access si observas una situación peligrosa, alguien angustiado, o violaciones de este código de conducta, incluso si parecen irrelevantes.

source: ## 4. Unacceptable Behaviour
es: ## 4. Comportamientos inaceptables

source: The following behaviours are considered harassment and are unacceptable within our community:
es: Los siguientes comportamientos se consideran acoso y son inaceptables dentro de nuestra comunidad:

source: * Violence, threats of violence or violent language directed against another person.
es: * Violencia, amenazas de violencia o lenguaje violento dirigido hacia otra persona.

source: * Sexist, racist, homophobic, transphobic, ableist or otherwise discriminatory jokes and language.
es: * Bromas o lenguaje discriminatorio sexista, racista, homófobo, tránsfobo, capacitista o de cualquier otro tipo.

source: * Posting or displaying sexually explicit or violent material.
es: * Publicar o mostrar material violento o sexualmente explícito.

source: * Posting or threatening to post other people's personally identifying information ("doxing").
es: * Publicar o amenazar con publicar información de identificación de otras personas ("doxing").

source: * Trolling, insulting/derogatory comments, and personal or political attacks
es: * Trolleos, insultos y comentarios vejatorios, y ataques personales y políticos

source: * Personal insults, particularly those related to gender, sexual orientation, race, religion, or disability.
es: * Insultos personales, especialmente aquellos relacionados con género, orientación sexual, raza, religión, o discapacidad.

source: * Inappropriate photography or recording.
es: * Fotografías o grabaciones inadecuadas.

source: * Unwelcome sexual attention. This includes sexualized comments or jokes, inappropriate touching, groping, and unwelcomed sexual advances.
es: * Atención sexual no deseada. Esto incluye comentarios sexuales o bromas, toques inadecuados, manoseos y avances sexuales no deseados.

source: * Deliberate intimidation, stalking or following (online or in person).
es: * Intimidación deliberada, acecho o seguimiento (en línea o en persona).

source: * Advocating for, or encouraging, any of the above behaviour.
es: * Abogar por, o fomentar cualquiera de los comportamientos anteriores.

source: * Sustained disruption of community events, including talks and presentations.
es: * Interrupción sostenida de eventos de la comunidad, incluyendo charlas y presentaciones.

source: ## 5. Consequences of Unacceptable Behaviour
es: ## 5. Consecuencias de los comportamientos inaceptables

source: Unacceptable behaviour from any community member, including sponsors and those with decision-making authority, will not be tolerated.
es: No se tolerarán comportamientos inaceptables de ningún miembro de la comunidad, incluidos patrocinadores y personas con autoridad para tomar decisiones.

source: Anyone asked to stop unacceptable behaviour is expected to comply immediately.
es: Se espera que cualquiera al que se le solicite que detenga un comportamiento inaceptable cumpla de inmediato.

source: If a community member engages in unacceptable behaviour, NV Access Staff may take any action they deem appropriate, up to and including a temporary ban or permanent expulsion from the community without warning (and without refund in the case of a paid event).
es: Si un miembro de la comunidad cae en un comportamiento inaceptable, el equipo de NV Access puede tomar cualquier acción que considere adecuada, hasta expulsar temporal o permanentemente al usuario de la comunidad sin previo aviso (y sin reembolso en caso de un evento de pago).

source: NV Access Staff have the right and responsibility to remove, edit, or reject comments, commits, code, wiki edits, issues, and other contributions that are not aligned to this Code of Conduct, or to ban temporarily or permanently any contributor for other behaviours that they deem inappropriate, threatening, offensive, or harmful.
es: El equipo de NV Access tiene el derecho y la responsabilidad de eliminar, editar o rechazar comentarios, commits, código, ediciones de la wiki, incidencias, y otras contribuciones que no estén alineadas con este código de conducta, o bloquear temporal o permanentemente a cualquier colaborador por otros comportamientos que consideren inadecuados, amenazantes, ofensivos o dañinos.

source: ## 6. Reporting Guidelines
es: ## 6. Pautas para denunciar

source: If you are subject to or witness unacceptable behaviour, or have any other concerns, please notify NV Access staff as soon as possible via info@nvaccess.org. The information required for notifications includes PR/Issue Number, nature of breach, community member responsible, date and time of breach. Please note that the details of the reporter will not be disclosed, unless required to by law.
es: Si estás sujeto a o eres testigo de un comportamiento inaceptable, o tienes cualquier otra inquietud, avisa a NV Access lo antes posible mediante info@nvaccess.org. La información necesaria para las notificaciones incluye el número de incidencia o solicitud de cambio, naturaleza del suceso, miembro de la comunidad responsable, fecha y hora del suceso, etc. Ten en cuenta que no se publicarán los detalles del denunciante, a menos que la ley lo requiera.

source: ## 7. Addressing Grievances
es: ## 7. Gestión de reclamaciones

source: If you feel you have been falsely or unfairly accused of violating this Code of Conduct, you should notify NV Access at info@nvaccess.org with a concise description of your grievance.
es: Si sientes que se te ha acusado falsa o injustamente de violar este código de conducta, deberías notificar a NV Access en info@nvaccess.org con una descripción concisa de tu reclamación.

source: ## 8. Scope
es: ## 8. Ámbito

source: We expect all community participants (contributors, paid or otherwise; sponsors; and other guests) to abide by this Code of Conduct in all community venues--online and in-person--as well as in all one-on-one communications pertaining to community business.
es: Esperamos que todos los participantes de la comunidad (colaboradores, pagados o no, patrocinadores y otros invitados) cumplan este código de conducta en todos los lugares de la comunidad --en línea y en persona--, así como en las comunicaciones individuales relacionadas con los negocios de la comunidad.

source: This code of conduct and its related procedures also applies to unacceptable behaviour occurring outside the scope of community activities when such behaviour has the potential to adversely affect the safety and well-being of community members.
es: Este código de conducta y sus procedimientos relacionados se aplican también a los comportamientos inaceptables que tengan lugar fuera del ámbito de las actividades de la comunidad cuando dichos comportamientos afecten potencialmente de forma adversa a la seguridad y el bienestar de los miembros de la comunidad.

source: For others setting up or running an NVDA group of any kind, it is strongly recommended that a complementary Citizen and Contributor Code of Conduct is adopted.
es: Se recomienda encarecidamente que todos aquellos que lideren o creen grupos de cualquier tipo relacionados con NVDA adopten un código complementario de conducta para colaboradores y ciudadanos.

source: ## 9. Contact info
es: ## 9. Información de contacto

source: ## 10. License and attribution
es: ## 10. Licencia y atribuciones

source: The Citizen and Contributor Code of Conduct is distributed by NV Access Limited.
es: El código de conducta del ciudadano y el colaborador es distribuido por NV Access Limited.

source: Portions of text were derived from the GitHub sample Citizen and Contributor Code of Conduct, which is distributed under a Creative Commons Attribution-ShareAlike license.
es: Partes de este texto derivan del código de conducta del ciudadano y el colaborador de ejemplo de GitHub, que se distribuye bajo una licencia Creative Commons Attribution-ShareAlike.

source: Revision1.0 adopted by NV Access Limited on 2020-09-23
es: Revisión 1.0 adoptada por NV Access Limited el 23-09-2020
