Repository: jmdaweb/devguides_translation
Catalog: translations/*/LC_MESSAGES/Connect.po
Languages: es

source: [][[# Connect with the NVDA Community
es: [][[# Comunidades en otros idiomas

source: ## Official project resources
es: La comunidad de NVDA es enorme. De hecho no podríamos hablar de una comunidad propiamente dicha, sino de un enorme conjunto de comunidades alrededor de todo el mundo, interconectadas entre sí en mayor o menor grado, en varios idiomas y con opiniones muy diversas. ## Recursos oficiales

source: ### Gitter Chat Room
es: ### Sala de chat en Jitter

source: If you would like to text chat with the developers or other NVDA users directly, other than sending -emails, you may wish to join the [NVDA chat room on Gitter](https://gitter.im/nvaccess/NVDA). It is the chat room that has been set up for discussions of all issues related to NVDA. Also, you may share tips and personal stories about using NVDA, and you may ask relevant questions after reviewing the website and product documentation, or feel free to chat about more expected features and/or bug fixes.
es: Si quieres intercambiar mensajes de texto con los desarrolladores de NVDA, o directamente con otros usuarios, en vez de enviar correos puedes unirte a la [sala de chat de NVDA en Jitter](https://gitter.im/nvaccess/NVDA). Se trata del canal que se ha creado para debatir sobre los problemas de NVDA. También puedes compartir consejos y experiencias personales sobre NVDA, y hacer preguntas relevantes después de leer toda la documentación y explorar el sitio web, o hablar de sugerencias y nuevas características que se podrían añadir al lector de pantalla (en inglés).

source: If you prefer using IRC, you can also [connect to Gitter using an IRC client](https://irc.gitter.im/).
es: Si prefieres utilizar IRC, también puedes [conectarte a Jitter usando un cliente IRC](https://irc.gitter.im/).

source: ## Other Community Sites, Blogs and Email Lists
es: ## Webs de otras comunidades, blogs y listas de correo

source: ### International users' mailing List (English)
es: ### Lista de correo internacional para usuarios (en inglés)

source: To join the users' list, send a blank email to:
es: Para unirte a la lista de usuarios, envía un correo vacío a la dirección:

source: You can also visit [the homepage](https://nvda.groups.io/g/nvda) of the users' email list where you can subscribe, search and read list archives.
es: También puedes visitar la [web de la lista de correo](https://nvda.groups.io/g/nvda), donde podrás suscribirte, buscar y leer los mensajes de la lista.

source: ### English language Facebook group
es: ### Grupo de Facebook en inglés

source: A community created group on Facebook for discussion of anything related to NVDA: https://www.facebook.com/groups/nvdaforum/
es: Una comunidad ha creado un grupo en Facebook para debatir cualquier cosa relacionada con NVDA: https://www.facebook.com/groups/nvdaforum/

source: ### Resources for specific languages
es: ### Recursos en idiomas específicos

source: Since the creation of NVDA, the community has created a number of independent websites, blogs and mailing lists to discuss all issues related to NVDA in their native languages. The following list shows those web resources in alphabetical order.
es: Desde el nacimiento de NVDA, la comunidad ha creado un gran número de sitios web independientes, blogs y listas de correo para debatir sobre todos los problemas relacionados con NVDA en sus idiomas nativos. La siguiente lista muestra esos recursos web.

source: Note:
es: Nota:

source: The web resources mentioned in the following list are published independently; that's to say, they are written entirely by NVDA community around the world and thus the information/opinions expressed may not be the same as that held by the NVDA project team.
es: Los recursos web mencionados en la siguiente lista han sido publicados de manera independiente; es decir, han sido aportados por miembros de la comunidad de NVDA de todo el mundo. Por tanto, las opiniones expresadas y la información disponible puede no ser la misma que maneja el equipo del proyecto NVDA.

source: * Arabic website: https://www.nvda-ar.org
es: * Sitio web árabe: https://www.nvda-ar.org

source: * Arabic discussion list: https://groups.io/g/nvda-ar
es: * Lista de debate árabe: https://groups.io/g/nvda-ar

source: * Czech/Slovak Blog: http://nvda-project.cz
es: * Blog checo y eslovaco: http://nvda-project.cz

source: * Danish website: http://www.nvda.dk
es: * Sitio web danés: http://www.nvda.dk

source: * Danish Email list: http://www.freelists.org/list/nvdadk
es: * Lista de correo danesa: http://www.freelists.org/list/nvdadk

source: * Danish NVDA Facebook group: http://www.facebook.com/home.php?#!/group.php?gid=126483014066763&ref=ts
es: * Grupo danés de NVDA en Facebook: http://www.facebook.com/home.php?#!/group.php?gid=126483014066763&ref=ts

source: * Dutch website: https://www.nvda-nl.org
es: * Sitio web neerlandés: https://www.nvda-nl.org

source: * Dutch wiki: https://wiki.nvda-nl.org
es: * Wiki neerlandesa: https://wiki.nvda-nl.org

source: * Dutch Email List: to subscribe, send a blank email to nvdadutch+subscribe@groups.io and reply to the received message.
es: * Lista de correo en neerlandés: para suscribirte, envía un correo vacío a nvdadutch+subscribe@groups.io y responde al mensaje recibido.

source: * Finnish: http://groups.yahoo.com/group/nvda-finland
es: * Finés: http://groups.yahoo.com/group/nvda-finland

source: * French: http://www.nvda-fr.org
es: * Francés: http://www.nvda-fr.org

source: * German: https://www.facebook.com/groups/1899444343635975/?fref=nf
es: * Alemán: https://www.facebook.com/groups/1899444343635975/?fref=nf

source: * German Email List: to subscribe, send a blank email to nvda-german-subscribe@ml4free.de with "subscribe" in the subject line.
es: * Lista de correo en alemán: para suscribirte, envía un correo vacío a nvda-german-subscribe@ml4free.de con el asunto "subscribe".

source: * Hungarian: http://www.nvda.hu
es: * Húngaro: http://www.nvda.hu

source: * Hungarian Email List: http://nvda.hu/mailman/listinfo/lista_nvda.hu
es: * Lista de correo en húngaro: http://nvda.hu/mailman/listinfo/lista_nvda.hu

source: * Italian: http://www.nvda.it
es: * Italiano: http://www.nvda.it

source: * Japanese website: http://www.nvda.jp/
es: * Sitio web japonés: http://www.nvda.jp/

source: * Japanese mailing list: Send a blank message to nvda-japanese-users+subscribe@googlegroups.com with subscribe as the subject line.
es: * Lista de correo en japonés: envía un correo vacío a nvda-japanese-users+subscribe@googlegroups.com con la palabra subscribe en el asunto.

source: * Korean users forum on Facebook: https://www.facebook.com/groups/nvdakr
es: * Foro coreano de usuarios en Facebook: https://www.facebook.com/groups/nvdakr

source: * Polish: http://www.nvda.pl
es: * Polaco: http://www.nvda.pl

source: * Portuguese mailing list: to subscribe, send a blank email to nvdaemportugues+subscribe@googlegroups.com. Note that this list was formerly on Yahoo Groups.
es: * Lista de correo en portugués: para suscribirte, envía un correo vacío a nvdaemportugues+subscribe@googlegroups.com. Esta lista se encontraba antes en grupos de Yahoo.

source: * Romanian website: http://www.nvda.ro
es: * Sitio web rumano: http://www.nvda.ro

source: * Romanian mailing list: To subscribe, send an e-mail to NVDA-romanian-comunity+subscribe@googlegroups.com or you can access the link https://groups.google.com/forum/#!forum/nvda-romanian-comunity to subscribe via web.
es: * Lista de correo en rumano: para suscribirte, envía un correo vacío a NVDA-romanian-comunity+subscribe@googlegroups.com o entra en el siguiente enlace: https://groups.google.com/forum/#!forum/nvda-romanian-comunity para suscribirte vía web.

source: * Russian mailing list: To subscribe, send a blank email to nvda-rus-subscribe@tiflo.info and reply to the received message.
es: * Lista de correo en ruso: para suscribirte, envía un correo vacío a nvda-rus-subscribe@tiflo.info y responde al mensaje recibido.

source: * Spanish community (two different teams):
es: * Comunidad española (dos equipos diferentes):

source: * NVDA en español (owner: [@nvda-es](https://github.com/nvda-es))
es: * NVDA en español (propietario: [@nvda-es](https://github.com/nvda-es))

source: * Spanish website: https://nvda.es
es: * Sitio web en español: https://nvda.es

source: * Spanish mailing list: To subscribe, send a blank e-mail to nvda-es+subscribe@googlegroups.com
es: * Lista de correo en español: para suscribirte, envía un correo vacío a nvda-es+subscribe@googlegroups.com

source: * Comunidad hispanohablante de NVDA (owner: [@nvdaes](https://github.com/nvdaes))
es: * Comunidad hispanohablante de NVDA (propietario: [@nvdaes](https://github.com/nvdaes]))

source: * Spanish website: https://nvdaes.github.io
es: * Sitio web en español: https://nvdaes.github.io

source: * Spanish mailing list: To subscribe, send a blank e-mail to lista+subscribe@nvdaes.groups.io
es: * Lista de correo en español: para suscribirte, envía un correo vacío a lista+subscribe@nvdaes.groups.io

source: * Swedish mailing list: To subscribe send a blank email to nvda-request@smartlist.nu putting subscribe in the subject line.
es: * Lista de correo en sueco: para suscribirte, envía un correo vacío a nvda-request@smartlist.nu poniendo la palabra subscribe en el asunto.

source: * Turkish mailing list: http://groups.yahoo.com/group/nvda_tr
es: * Lista de correo en turco: http://groups.yahoo.com/group/nvda_tr

source: * NVDA Simplified Chinese website: http://www.nvdacn.com
es: * Web de NVDA en chino simplificado: http://www.nvdacn.com

source: * NVDA Simplified Chinese Website is the official website of NVDA China Mainland. It provides the latest tutorials on
es: * El sitio web de NVDA en chino simplificado es el sitio web oficial de NVDA en China. Proporciona los tutoriales más actualizados,

source: NVDA Simplified Chinese news and plugins.
es: Noticias y complementos de NVDA en chino simplificado.
