Repository: jmdaweb/devguides_translation
Catalog: translations/*/LC_MESSAGES/contributing.po
Languages: es

source: # Contributing to NVDA
es: # Cómo contribuir con NVDA

source: There are several ways in which you can contribute to the NVDA project:
es: Hay diversas maneras de colaborar con el proyecto NVDA:

source: - By testing NVDA
es: - Probando NVDA

source: - Issue triage and investigation
es: - Clasificación e investigación de incidencias

source: - Code or documentation contributions
es: - Contribuciones de documentación o código

source: ## Note: Currently only accepting bug-fix / maintenance PR's only while addressing backlog.
es: ## Nota: actualmente sólo se aceptan solicitudes de cambio de mantenimiento o corrección de fallos mientras se procesa la cola existente.

source: For more information please see: https://github.com/nvaccess/nvda/issues/11006
es: Para más información, consulta: https://github.com/nvaccess/nvda/issues/11006

source: ## Testing
es: ## Pruebas

source: Testing alpha / beta / and release candidates help to ensure the quality of the NVDA.
es: Hacer pruebas sobre las Alfa / beta / candidatas a liberación garantiza la calidad de NVDA.

source: User / community testing is particularly important for languages other than English.
es: Las pruebas de los usuarios y de la comunidad en general son particularmente importantes con idiomas distintos al inglés.

source: There are several approaches you may take for this:
es: Hay varios enfoques que se pueden tomar para ellas:

source: - Unfocused usage: Just use NVDA as you normally would, and try to complete everyday tasks.
es: - Uso no enfocado: simplemente utiliza NVDA como lo harías normalmente, e intenta completar tareas cotidianas.

source: - Recent change focused testing: By following the changes that are being made to NVDA and purposefully testing these changes and looking for edge-cases.
es: - Pruebas enfocadas a cambios recientes: siguiendo los cambios que se han hecho en NVDA y probándolos a propósito con casos extremos.

source: - Regression testing: Testing older features and behavior to look for unintended regressions in behavior that don't seem related to recent changes.
es: - Prueba de regresiones: se prueban funciones antiguas y su comportamiento para buscar regresiones no intencionadas cuyo comportamiento no parezca relacionado con los cambios recientes.

source: Forming a group can help you to get good coverage, brainstorm on what should be tested, and perhaps learn new ways to use NVDA.
es: Formar un grupo puede ayudar a obtener una buena cobertura, ideas sobre lo que se debe probar, y quizá aprender nuevas formas de usar NVDA.

source: ## Issue triage and investigation:
es: ## Clasificación en investigación de incidencias:

source: You can also make non-code contributions by helping process incoming GitHub issues. For information on this please see the [triage process](https://github.com/nvaccess/nvda/wiki/Triage-process) and [issue triage help](https://github.com/nvaccess/nvda/wiki/Issue-triage-help) on the wiki.
es: También puedes hacer contribuciones que no sean de código, ayudando a procesar las incidencias entrantes en GitHub. Para más información, consulta los documentos relacionados con la clasificación de incidencias en nuestra web.

source: ## Code/Docs contributions
es: ## Contribuciones de código / documentos

source: If you are new to the project, or looking for some way to help take a look at:
es: Si eres nuevo en el proyecto o buscas una forma de ayudar, echa un vistazo a:

source: ### Guidelines:
es: ### Pautas:

source: - For anything other than minor bug fixes, please comment on an existing issue or create a new issue providing details about your proposed change.
es: - Para cualquier cosa distinta a la reparación de problemas pequeños, por favor comenta en una incidencia existente o crea una incidencia nueva exponiendo los detalles del cambio que propones.

source: - Unrelated changes should be addressed in separate issues.
es: - Los cambios no relacionados se deben gestionar en incidencias separadas.

source: - Include information about use cases, design, user experience, etc.
es: - Incluye información sobre casos de uso, diseño, experiencia de usuario, etc.

source: - This allows us to discuss these aspects and any other concerns that might arise, thus potentially avoiding a great deal of wasted time.
es: - Eso permitirá a los desarrolladores discutir los aspectos y consecuencias derivadas del cambio, y potencialmente evitará gastar tiempo inútilmente.

source: - It is recommended to wait for acceptance of your proposal before you start coding.
es: - Es recomendable esperar la aceptación de tu propuesta antes de que empieces a codificar.

source: - Please understand that we very likely will not accept changes that are not discussed first.
es: - Ten en cuenta que NV Access no aceptará cambios que no se hayan discutido previamente.

source: - Consider starting a discussion on mailing lists (EG NVDA developers) to see if there is interest.
es: - Plantéate iniciar un debate por las listas de correo (por ejemplo NVDA Developers) para ver si hay interés.

source: - A minor/trivial change which definitely wouldn't require design, user experience or implementation discussion, you can just create a pull request rather than using an issue first.
es: - Un cambio menor / trivial que no requiera definitivamente debates sobre diseño, experiencia de usuario o implementación puede ir directamente en una solicitud de cambio sin crear una incidencia antes.

source: - E.G. a fix for a typo/obvious coding error or a simple synthesizer/braille display driver
es: - Por ejemplo, una corrección de un error obvio de codificación o escritura o un controlador simple de síntesis o pantalla Braille

source: - This should be fairly rare.
es: - Esto debería ser raro.

source: - If in doubt, use an issue first. Use this issue to discuss the alternatives you have considered in regards to implementation, design, and user experience. Then give people time to offer feedback.
es: - Ante cualquier duda, usa una incidencia primero. Utilízala para debatir sobre las alternativas planteadas respecto a la implementación, el diseño y la experiencia de usuario. Después, da tiempo a la gente para que ofrezca retroalimentación.

source: ### GitHub process:
es: ### Proceso de GitHub:

source: #### 1. "fork" the NVDA repository on GitHub
es: #### 1. "Bifurca" el repositorio de NVDA en GitHub

source: When you fork the repository, GitHub will create a copy of the master branch.
es: Cuando bifurques el repositorio, GitHub creará una copia de la rama master.

source: However, this branch will not be updated when the official master branch is updated.
es: Sin embargo, esta rama no se actualizará cuando lo haga la rama master oficial.

source: To ensure your work is always based on the latest commit in the official master branch, it is recommended that your master branch be linked to the official master branch, rather than the master branch in your GitHub fork.
es: Para asegurarte de que tu trabajo siempre se basa en el último commit de la rama master oficial, se recomienda que vincules la copia de tu rama a la oficial en vez de la que hay en tu cuenta.

source: If you have cloned your GitHub fork, you can do this from the command line as follows:
es: Si has clonado tu bifurcación de GitHub, puedes hacerlo desde la línea de órdenes del siguiente modo:

source: # Add a remote for the NV Access repository.
es: # Añadir un origen remoto con el repositorio de NV Access.

source: # Fetch the nvaccess branches.
es: # Descargar las ramas de NV Access.

source: # Switch to the local master branch.
es: # Cambiar a la rama master local.

source: # Set the local master to use the nvaccess master as its upstream.
es: # configurar la rama master local para que utilice por defecto la rama master de NV Access.

source: # Update the local master.
es: # Actualizar la rama master local.

source: #### 2. Use a separate "topic" branch for each contribution
es: #### 2. Usa una rama "temática" separada para cada contribución

source: All code should usually be based on the latest commit in the official master branch at the time you start the work unless the code is entirely dependent on the code for another issue.
es: Todo el código debería basarse en el commit más reciente de la rama master oficial que hay en el momento en que empiezas a trabajar, a no ser que el código oficial sufra cambios drásticos que afecten a tu trabajo o dependa del código de otra incidencia.

source: If you are adding a feature or changing something that will be noticeable to the user, you should update the User Guide accordingly.
es: Si vas a añadir algo de lo que el usuario se vaya a dar cuenta, deberías actualizar la guía de usuario convenientemente para reflejar tu cambio.

source: #### 3. Run unit tests and lint check
es: #### 3. Ejecuta las pruebas unitarias y de estilo

source: - Run `rununittests` (`rununittests.bat`) before you open your Pull Request, and make sure all the unit tests pass.
es: - Ejecuta `rununittests` (`rununittests.bat`) antes de abrir tu solicitud de cambios, y comprueba que se superan todas las pruebas unitarias.

source: - If possible for your PR, please consider creating a set of unit tests to test your changes.
es: - Si es posible para tu solicitud de cambios, plantéate crear un conjunto de pruebas unitarias para evaluar tus cambios.

source: - The lint check ensures your changes comply with our code style expectations. Use `runlint nvaccess/master` (`runlint.bat`)
es: - La comprobación de estilo garantiza que tu código cumple con nuestras expectativas de estilo del código. Usa `runlint nvaccess/master` (`runlint.bat`)

source: #### 4. Create a Pull Request (PR)
es: #### 4. Crea una solicitud de cambios (PR o Pull Request)

source: When you think a contribution is ready, or you would like feedback, open a draft pull request.
es: Cuando creas que una contribución está lista, o quieras recibir comentarios, abre un borrador de solicitud de cambios.

source: Please fill out the Pull Request Template, including the checklist of considerations.
es: Rellena la plantilla de solicitud de cambios, incluyendo las consideraciones de la lista de comprobación.

source: The checklist asks you to confirm that you have thought about each of the items, if any of the items are missing it is helpful to explain elsewhere in the PR why it has been left out.
es: La lista de comprobación te pide que confirmes que has pensado en todos los elementos. Si falta alguno de ellos, viene bien explicar en algún lugar de la solicitud por qué se ha descartado.

source: When you would like a review, mark the PR as "ready for review".
es: Cuando quieras una revisión, marca la solicitud como "ready for review".

source: #### 5. Participate in the code review process
es: #### 5. Participa en el proceso de revisión del código

source: This process requires core NVDA developers to understand the intent of the change, read the code changes, asking questions or suggesting changes.
es: Este proceso requiere que los desarrolladores principales de NVDA entiendan el propósito del cambio, lean los cambios en el código, hagan preguntas o sugieran modificaciones.

source: Please participate in this process, answering questions, and discussing the changes.
es: Participa en este proceso, responde a las preguntas y debate sobre los cambios.

source: Being proactive will really help to speed up the process of code review.
es: Ser proactivo acelerará notablemente el proceso de revisión del código.

source: When the PR is approved it will be merged, and the change will be active in the next Alpha build.
es: Cuando se apruebe la solicitud de cambio se fusionará, y dicho cambio estará activo en la siguiente compilación Alpha.

source: #### 6. Feedback from Alpha users
es: #### 6. Comentarios de los usuarios Alpha

source: After a PR is merged, watch for feedback from Alpha users / testers.
es: Después de que se fusione una solicitud de cambios, estáte atento a los comentarios de los usuarios y evaluadores Alpha.

source: You may have to follow up to address bugs or missed use-cases.
es: Puedes tener que continuar para solucionar fallos o tener en cuenta casos de uso imprevistos.

source: ## Code Style
es: ## Estilo del código

source: Code style is enforced with the flake8 linter, see [`tests/lint/readme.md`](https://github.com/nvaccess/nvda/tree/master/tests/lint) for more information.
es: El estilo del código está reforzado por el comprobador de conformidad Flake8, visita [`tests/lint/readme.md`](https://github.com/nvaccess/nvda/tree/master/tests/lint) para más información.

source: ### Encoding
es: ### Codificación

source: * Where Python files contain non-ASCII characters, they should be encoded in UTF-8.
es: * Cuando los archivos Python contengan caracteres que no sean Ascii, deberán estar codificados en UTF-8.

source: * There should be no Unicode BOM at the start of the file, as this unfortunately breaks one of the translation tools we use (`xgettext`). Instead, include this as the first line of the file (only if the file contains non-ASCII characters):
es: * No debería haber bom Unicode al principio del archivo, ya que esto desafortunadamente rompe una de las herramientas de traducción que usamos (`xgettext`). En su lugar, incluye esto como primera línea del archivo (sólo si el archivo contiene caracteres no ASCII):

source: * This coding comment must also be included if strings in the code (even strings that aren't translatable) contain escape sequences that produce non-ASCII characters; e.g. `"\xff"`. This is particularly relevant for braille display drivers. This is due to a `gettext` bug; see https://github.com/nvaccess/nvda/issues/2592#issuecomment-155299911.
es: * Deberás incluir esta línea si las cadenas del código (incluso si estas no son traducibles) contienen secuencias de escape que producen caracteres no Ascii, tales como `"\xff"`. Esto es particularmente importante para controladores de pantallas braille. El responsable del fallo es `Gettext`, como se puede ver en https://github.com/nvaccess/nvda/issues/2592#issuecomment-155299911.

source: * Most files should contain `CRLF` line endings, as this is a Windows project and can't be used on Unix-like operating systems.
es: * La mayoría de los archivos deben contener saltos de línea en formato `crlf` de Windows. Este es un proyecto hecho exclusivamente para Windows, y no se puede usar en sistemas operativos derivados de Unix.

source: ### Indentation
es: ### Indentado

source: * Indentation must be done with tabs (one per level), not spaces.
es: * La indentación se debe hacer con tabuladores (uno por nivel) y no con espacios.

source: * When splitting a single statement over multiple lines, just indent one or more additional levels. Don't use vertical alignment; e.g. lining up with the bracket on the previous line.
es: * Al dividir una instrucción en varias líneas, indéntala con uno o más niveles. No uses alineación vertical del tipo “alinear con el corchete de la línea superior”.

source: - Be aware that this requires a new-line after an opening parenthesis/bracket/brace if you intend to split the statement over multiple lines.
es: - Sé consciente de que esto necesita un salto de línea después de abrir un paréntesis, corchete o llave si pretendes dividir la instrucción en varias líneas.

source: - For the parameter list of function definitions, double indent, this differentiates the parameters and the body of the function.
es: - En la lista de parámetros de la definición de funciones, da un margen doble para diferenciar los parámetros del cuerpo de la función.

source: ### Identifier Names
es: ### Nombres de identificadores

source: * Use descriptive names
es: * Usa nombres descriptivos

source: - name constants to avoid "magic numbers" and hint at intent or origin of the value. Consider, what does this represent?
es: - nombra las constantes para evitar "números mágicos" y da una pista sobre la intención u origen del valor. Pregúntate ¿qué representa?

source: * Functions, variables, properties, etc. should use mixed case to separate words, starting with a lower case letter; e.g. `speakText`.
es: * Las funciones, propiedades, variables, etc. deberían usar mayúsculas para separar palabras, pero empezar con una letra minúscula; por ejemplo, `speakText`.

source: * Boolean functions or variables
es: * Funciones booleanas o variables

source: - should try to use the positive form of the language (to avoid double negatives like `shouldNotDoSomething = False`)
es: - deberían intentar usar la forma positiva del idioma (para evitar dobles negativos como `shouldNotDoSomething = False`)

source: - start with a "question word" to hint at their boolean nature. EG `shouldX`, `isX`, `hasX`
es: - comienza con una "palabra de pregunta" para dar una pista sobre su naturaleza booleana. Ejemplos: `shouldX`, `isX`, `hasX`

source: * Classes should use mixed case to separate words, starting with an upper case letter; e.g. `BrailleHandler`.
es: * El caso anterior también se aplica para las clases, pero en vez de empezar en minúscula lo hacen en mayúscula; por ejemplo, `BrailleHandler`.

source: * Constants should be all upper case, separating words with underscores; e.g. `LANGS_WITH_CONJUNCT_CHARS`.
es: * Las constantes siempre deben estar en mayúscula, separando las palabras con guiones bajos. Por ejemplo, `LANGS_WITH_CONJUNCT_CHARS`.

source: * Event handlers are prefixed with "event_", and are often in the form "event_ACTION" or "event_OBJECT_ACTION". Where OBJECT refers to the class type that the ACTION refers to.
es: * Los manejadores de eventos tienen el prefijo "event_", y tienen la forma "event_ACTION" o "event_OBJECT_ACTION", donde OBJECT hace referencia al tipo de clase a la que se refiere la acción.

source: * Extension points:
es: * Puntos de extensión:

source: * `Action`: Prefixed with `pre_` or `post_` to specify that handlers are being notified before / after the action has taken place.
es: * `Action`: lleva el prefijo `pre_` o `post_` para especificar que se notifica a los manejadores antes o después de que la acción tenga lugar.

source: * `Decider`: Prefixed with `should_` to turn them into a question eg `should_doSomething`
es: * `Decider`: lleva el prefijo `should_` para mostrarlo como una pregunta. Por ejemplo, `should_doSomething`

source: * `Filter`: TBD. Ideally follows a similar style the others, and communicates if the filtering happens before or after some action. It would also be nice to have a naming scheme that differentiates it from the others.
es: * `Filter`: por determinar. lo ideal es que siga el mismo estilo que los otros, y comunicar si el filtro ocurre antes o después de la acción. Sería estupendo tener también un esquema de nombres que lo diferencie de los otros.

source: ### Translatable Strings
es: ### Cadenas traducibles

source: * All strings that could be presented to the user should be marked as translatable using the `_()` function; e.g. `_("Text review")`.
es: * Todas las cadenas que se puedan mostrar al usuario deberían marcarse como traducibles usando la función `_()`. Por ejemplo, en vez de poner `"text review"` pondríamos en su lugar `_("text review")`.

source: * All translatable strings should have a preceding translators comment describing the purpose of the string for translators. For example:
es: Todas las cadenas traducibles deberían estar precedidas por un comentario en inglés para traductores que describa claramente su propósito. Por ejemplo:

source: * Lengthy translatable strings can be split across multiple lines, taking advantage of Python's implicit line joining inside parentheses. Translators comment can span multiple lines as well. For example:
es: * Se pueden dividir las cadenas traducibles largas en múltiples líneas, aprovechando la ventaja que ofrece la unión implícita de líneas entre paréntesis de Python. Los comentarios para traductores pueden ocupar varias líneas también. Por ejemplo:
