Repository: jmdaweb/devguides_translation
Catalog: translations/*/LC_MESSAGES/DependencyUpdates.po
Languages: es

source: IMPORTANT: draft document, subject to change without notice, guidance from NV Access superseeds this document.
es: Importante: documento en borrador, sujeto a cambios sin previo aviso, el guiado de NV Access tiene prioridad sobre él.

source: This document describes procedure to use when updating dependencies.
es: Este documento describe el procedimiento a seguir para actualizar las dependencias.

source: ## Background
es: ## Contexto

source: NVDA project uses third-party modules for operations such as compiling NVDA from source code, speech output, user interface, and other tasks. Key dependencies include Python, wxPython, SCons, and Liblouis.
es: El proyecto NVDA usa módulos de terceros para operaciones como compilarse desde el código fuente, salida de voz, interfaz de usuario y otras tareas. Entre las dependencias clave se incluyen Python, WXPython, SCons y Liblouis.

source: As dependencies are updated from time to time, it is important for NVDA project to use recent versions of these dependencies. However, the community must consider factors such as stability, compatibility, and security when choosing dependencies and their versions.
es: Ya que las dependencias se actualizan de vez en cuándo, es importante que el proyecto NVDA utilice versiones recientes de ellas. Sin embargo, la comunidad debe considerar factores como estabilidad, compatibilidad y seguridad al elegir dependencias y sus versiones.

source: ## General rules
es: ## Reglas generales

source: * Dependency checks should be done at least once a year.
es: * Se deberían realizar comprobaciones de dependencias al menos una vez al año.

source: * For critical dependencies such as Python (those that are required to build and run NVDA), updates should target year.1 (backwards incompatible) release.
es: * En dependencias críticas, como Python (aquellas necesarias para construir y ejecutar NVDA), las actualizaciones deberían tener como objetivo la versión año.1 (incompatible hacia atrás).

source: * For dependencies with predictable release schedule such as Liblouis, most recent public release should be attempted.
es: * En dependencias con un calendario de liberación predecible, como Liblouis, se debería intentar usar la versión pública más reciente.

source: ## Specific dependencies
es: ## Dependencias concretas

source: ### Visual Studio and Windows SDK
es: ### Visual Studio y el SDK de Windows

source: ## Other dependencies
es: ## Otras dependencias
