Repository: jmdaweb/devguides_translation
Catalog: translations/*/LC_MESSAGES/espeak.po
Languages: es

source: # Espeak-ng submodule
es: # Submódulo espeak-ng

source: The submodule contained in the espeak directory is a cross platform open source speech synthesizer.
es: El submódulo contenido en el directorio espeak es un sintetizador de voz multiplataforma de código abierto.

source: ### Background
es: ### Contexto

source: The main authority on build requirements should be `<nvda repo root>/include/espeak/Makefile.am`.
es: La autoridad principal de requisitos de compilación debería ser `<raíz del repositorio de NVDA>/include/espeak/Makefile.am`.

source: The `*.vcxproj` files in `<nvda repo root>/include/espeak/src/windows/` can also be considered,
es: También se pueden considerar los archivos `*.vcxproj` `<raíz del repositorio de NVDA>/include/espeak/src/windows/`,

source: however these are not always kept up to date.
es: pero no siempre se mantienen actualizados.

source: We don't use the auto make files or the visual studio files, we maintain our own method of building espeak.
es: No usamos los archivos de Auto Make o de Visual Studio, mantenemos nuestro propio método de compilación de Espeak.

source: Modifications will need to be made in `<nvda repo root>/nvdaHelper/espeak`
es: Será necesario hacer modificaciones en `<raíz del repositorio de NVDA>/nvdaHelper/espeak`

source: * `sconscript` for the build process.
es: * `sconscript` para el proceso de compilación.

source: * `config.h` to set the eSpeak-ng version that NVDA outputs to the log file.
es: * `config.h` para configurar la versión de Espeak-NG que NVDA muestra en el archivo de registro.

source: ### Doing the update
es: ### Proceso de actualización

source: 1. Start from a clean branch off of NVDA `master`
es: 1. Comienza en una rama `master` de NVDA limpia

source: 1. Check out the latest NVDA `origin/master` and create a new branch.
es: 1. Descarga la rama más reciente de NVDA `origin/master` y crea una nueva rama.

source: 1. Do a git clean to ensure the working directory is clean.
es: 2. Ejecuta git clean para asegurarte de que el directorio de trabajo esté limpio.

source: 1. Ensure submodules are up to date
es: 2. Asegúrate de que los submódulos están actualizados

source: 1. Synchronize submodules with `git submodule sync`
es: 1. Sincroniza los submódulos con `git submodule sync`

source: 1. Update submodules with `git submodule update --init --recursive`
es: 2. Actualiza los submódulos con `git submodule update --init --recursive`

source: 1. Checkout the new eSpeak-ng revision to try.
es: 3. Cambia a la nueva revisión de Espeak-NG a probar.

source: 1. Change to the `include/espeak/` directory
es: 1. Cambia al directorio `include/espeak/`

source: 1. Do `git fetch` to get the latest from the espeak-ng repo
es: 2. Ejecuta `git fetch` para obtener los cambios más recientes del repositorio de Espeak-NG

source: 1. Do `git checkout origin/master` or whichever espeak-ng ref you wish.
es: 3. Ejecuta `git checkout origin/master` o la revisión de Espeak-NG que quieras.

source: 1. Look at changes in `Makefile.am` and update our build.
es: 4. Busca cambios en `Makefile.am` y actualiza nuestra compilación.

source: 1. Diff `Makefile.am` with the previously used commit of espeak.
es: 1. Haz un diff de `makefile.am` con el commit de Espeak que se usaba antes.

source: 1. Some modules are intentionally excluded from the build.
es: 2. Algunos módulos se excluyen intencionadamente de la compilación.

source: If unsure, err on the side of including it and raise it as a question when submitting a PR.
es: Si no estás seguro, no los incluyas y pregunta cuando envíes una solicitud de cambios.

source: 1. Modify the `<nvda repo root>/nvdaHelper/espeak/config.h` file as required.
es: 3. Modifica el archivo `<raíz del repositorio de NVDA>/nvdaHelper/espeak/config.h` según sea necesario.

source: 1. Update our record of the version number and build.
es: 5. Actualiza nuestro registro de número de versión y compila.

source: 1. Change back to the NVDA repo root
es: 1. Vuelve a la raíz del repositorio de NVDA

source: 1. Update the package version in `<nvda repo root>/nvdaHelper/espeak/config.h`
es: 2. Actualiza la versión del paquete en `<raíz del repositorio de NVDA>/nvdaHelper/espeak/config.h`

source: - Compare to espeak source info: `<nvda repo root>/include/espeak/src/windows/config.h`.
es: - Compara con la información del código fuente de Espeak: `<raíz del repositorio de NVDA>/include/espeak/src/windows/config.h`.

source: 1. Update NVDA `readme.md` with espeak version and commit.
es: 3. Actualiza el `readme.md` de NVDA con la versión de Espeak y haz commit.

source: 1. Build NVDA
es: 4. Construye NVDA

source: 1. Run NVDA (set eSpeak-ng as the synthesizer) and test.
es: 6. Ejecuta NVDA (configura Espeak-NG como sintetizador) y prueba.

source: 1. Ensure that the log file contains the new version number for eSpeak-NG
es: 7. Asegúrate de que el archivo de registro contiene el nuevo número de versión de Espeak-NG

source: ### Troubleshooting
es: ### Resolución de problemas

source: If python crashes while building, check the log.
es: Si Python falla mientras compila, comprueba el registro.

source: If the last thing is compiling some dictionary try excluding it.
es: Si la última acción fue compilar un diccionario, intenta excluirlo.

source: This can be done in `<nvda repo root>/nvdaHelper/espeak/sconscript`.
es: Esto se puede hacer en `<raíz del repositorio de NVDA>/nvdaHelper/espeak/sconscript`.

source: Remember to report this to the eSpeak-ng project.
es: Recuerda informar del fallo al proyecto Espeak-NG.

source: If the build fails, take note of the error, compare the diff of the `Makefile.am` file and mirror
es: Si la compilación falla, toma nota del error, compara las diferencias del archivo `makefile.am` y refleja

source: any changes in our `sconscript` file.
es: cualquier cambio en nuestro archivo `sconscript`.

source: ### Known issues
es: ### Problemas conocidos

source: Due to problems with emoji support (causing crashes), emoji dictionary files are being excluded
es: Debido a problemas con el soporte de emojis (que causa errores fatales), se excluyen los archivos de diccionario de emojis

source: from the build, they are deleted prior to compiling the dictionaries in the
es: de la compilación. Se eliminan antes de compilar los diccionarios en el

source: `<nvda repo root>/nvdaHelper/espeak/sconscript` file.
es: archivo `<raíz del repositorio de NVDA>/nvdaHelper/espeak/sconscript`.
