Repository: jmdaweb/devguides_translation
Catalog: translations/*/LC_MESSAGES/GitHubActions.po
Languages: es

source: # Using GitHub Actions to manage NVDA add-ons
es: # Uso de acciones de GitHub para gestionar complementos de NVDA

source: This document is based on the [article about Appveyor](https://github.com/nvdaaddons/nvdaaddons.github.io/wiki/appveyor).
es: Este documento está basado en el artículo sobre AppVeyor, disponible en la documentación sobre desarrollo de complementos de esta web.

source: ## Procedure to build, test with NVDA, lint diffs and attach addon binaries to releases on GitHub
es: ## Procedimiento para construir, probar con NVDA, comprobar estilo de las diferencias y adjuntar archivos nvda-addon a liberaciones de GitHub

source: ### Setting GitHub Actions for add-ons
es: ### Configuración de acciones de GitHub para complementos

source: This works for add-ons based on the [Add-on Template](https://github.com/nvdaaddons/addontemplate).
es: Esto funciona con complementos basados en la [plantilla de complemento](https://github.com/nvdaaddons/addontemplate).

source: 1. Get the code of an add-on.
es: 1. Consigue el código de un complemento.

source: Example:
es: Ejemplo:

source: git clone https://github.com/username/repo
es: git clone https://github.com/usuario/repo

source: 2. In the root of the add-on folder (where the sconstruct file is placed), paste this [Flake8 configuration file](https://gist.githubusercontent.com/nvdaes/9caffa59ebbdcfd3e69f8a200b512be9/raw/3cbaaff48239b1b98e863901cf6a76b955412df7/setup.cfg), which uses [Flake8 rules configured for NVDA](https://raw.githubusercontent.com/nvaccess/nvda/master/tests/lint/flake8.ini). This must be named setup.cfg
es: 2. En la carpeta raíz del complemento (donde se encuentra el archivo sconstruct), pega este [archivo de configuración de Flake8](https://gist.githubusercontent.com/nvdaes/9caffa59ebbdcfd3e69f8a200b512be9/raw/3cbaaff48239b1b98e863901cf6a76b955412df7/setup.cfg), que usa [reglas de Flake8 configuradas para NVDA](https://raw.githubusercontent.com/nvaccess/nvda/master/tests/lint/flake8.ini). El archivo debe llamarse setup.cfg

source: 3. In the same folder, paste this [requirements.txt file](https://raw.githubusercontent.com/nvaccess/nvda/master/tests/lint/lintInstall/requirements.txt)
es: 3. En la misma carpeta, pega este [archivo requirements.txt](https://raw.githubusercontent.com/nvaccess/nvda/master/tests/lint/lintInstall/requirements.txt)

source: 4. Under the root folder of the add-on repository, create a `.github/workflows` subdirectory.
es: 4. En la carpeta raíz del repositorio del complemento, crea la subcarpeta `.github/workflows`.

source: 5. Inside the `repositoryRootFolder/.github/workflows` subfolder, you can include GitHub workflow files (.yml or .yaml). Feel free to use, for example, workflows available at <https://github.com/nvdaes/clipContentsDesigner/tree/master/.github/workflows>
es: 5. Dentro de la subcarpeta `carpetaDelRepositorio/.github/workflows`, puedes incluir archivos de flujo de trabajo de Github (.yml o .yaml). Por ejemplo, usa con total libertad los flujos de trabajo disponibles en <https://github.com/nvdaes/clipContentsDesigner/tree/master/.github/workflows>

source: Here is info about [managing workflow runs](https://docs.github.com/en/free-pro-team@latest/actions/managing-workflow-runs).
es: Aquí hay información sobre la [gestión de ejecución de flujos de trabajo](https://docs.github.com/en/free-pro-team@latest/actions/managing-workflow-runs).

source: ### Releasing
es: ### Liberaciones

source: To post a new release of an add-on, you can create a tag and push it to GitHub:
es: Para publicar una nueva versión de un complemento, puedes crear una nueva etiqueta y enviar los cambios a GitHub:

source: Example
es: Ejemplo

source: Now, the release will be created and binary-1.0.nvda-addon will be attached on GitHub.
es: Ahora, se creará la liberación en GitHub y se adjuntará el archivo binary-1.0.nvda-addon.

source: With the provided yaml file, releases created from tags ending with "-dev" will be marked as prereleases.
es: Con el archivo yaml proporcionado, las liberaciones creadas a partir de etiquetas que terminen en "-dev" se marcarán como en desarrollo.

source: ## References
es: ## Referencias

source: ### Documentation
es: ### Documentación

source: - [GitHub Actions documentation](https://docs.github.com/en/free-pro-team@latest/actions)
es: - [Documentación de las acciones de GitHub](https://docs.github.com/en/free-pro-team@latest/actions)

source: - [Flake8 documentation](https://flake8.pycqa.org/en/latest/)
es: - [Documentación de Flake8](https://flake8.pycqa.org/en/latest/)

source: ### Used actions
es: ### Acciones utilizadas

source: - [actions/checkout: action for checking out a repo](https://github.com/actions/checkout)
es: - [actions/checkout: acción para hacer checkout en un repositorio](https://github.com/actions/checkout)

source: - [actions/upload-artifact](https://github.com/actions/upload-artifact): action for uploading artifacts
es: - [actions/upload-artifact](https://github.com/actions/upload-artifact): acción para subir artefactos

source: - [actions/download-artifact](https://github.com/actions/download-artifact): an action for downloading artifacts
es: - [actions/download-artifact](https://github.com/actions/download-artifact): una acción para descargar artefactos

source: - [unsplash/comment-on-pr@master](https://github.com/unsplash/comment-on-pr): an action to comment on a PR (may not work on Windows)
es: - [unsplash/comment-on-pr@master](https://github.com/unsplash/comment-on-pr): una acción para comentar en una solicitud de cambios (podría no funcionar en Windows)

source: - [action/GitHubScript](https://github.com/actions/github-script): scripting GitHub API in JavaScript
es: - [action/GitHubScript](https://github.com/actions/github-script): API de scripting de GitHub en JavaScript

source: - [actions/create-release: An Action to create releases via the GitHub Release API](https://github.com/actions/create-release)
es: - [actions/create-release: una acción para crear liberaciones mediante la API de liberaciones de GitHub](https://github.com/actions/create-release)

source: - [svenstaro/upload-release-action: Upload files to a GitHub release](https://github.com/svenstaro/upload-release-action)
es: - [svenstaro/upload-release-action: Subir archivos a una liberación de GitHub](https://github.com/svenstaro/upload-release-action)

source: ## Aknowledgements ###
es: ## Reconocimientos

source: The above workflows are created or based on work performed by @mhameed
es: Los flujos de trabajo de más arriba están basados o han sido creados a partir del trabajo realizado por @mhameed

source: Thanks also to @Josephsl and @CyrilleB79 for replies, as mentioned on this [message about GitHub workflows](https://nvda-addons.groups.io/g/nvda-addons/message/13492)
es: Gracias también a @josephsl y @CyrilleB79 por sus respuestas, como se menciona en este [mensaje sobre los flujos de trabajo de GitHub](https://nvda-addons.groups.io/g/nvda-addons/message/13492)
