Repository: jmdaweb/devguides_translation
Catalog: translations/*/LC_MESSAGES/nvdaPy3.po
Languages: es

source: 4. A stable version of NVDA powered by Python 3 is released.
es: 4. Se libera una versión estable de NVDA que funcione con Python 3.

source: 5. Post-transition evaluation should take place, including documenting issues found during field testing, more community outreach and other activities.
es: 5. Debería tener lugar una evaluación tras la transición, que incluya problemas documentados durante las pruebas de campo, más extensión a la comunidad y otras actividades.

source: 6. If needed, attempts to use Python 3 native features should be attempted (see below for a list of possible features and their impact on NVDA).
es: 6. Si es necesario, se deberían hacer intentos para utilizar las características nativas de Python 3 (a continuación se muestra una lista de características y su posible impacto en NVDA).

source: Completed on: May 1, 2020
es: Completado: 1 de mayo de 2020

source: ## Transition progress
es: ## Progreso de la transición

source: 1. Before transition (done):
es: 1. Antes de la transición (completado):

source: 1. July 17, 2018: NVDA alpha snapshot powered by wxPython 4.0.3 was released.
es: 1. 17 de julio de 2018: se liberó una alpha de NVDA con WXPython 4.0.3 integrado.

source: 2. August 17, 2018: NVDA 2018.3 beta 3, the first beta release powered by wxPython 4.0.3, was released.
es: 2. 17 de agosto de 2018: se liberó NVDA 2018.3 beta 3, la primera versión beta que funciona con WXPython 4.0.3.

source: 3. August 21, 2018: alpha snapshots include Python 3 import edits. Source code changed to use Python 3 module names in most cases.
es: 3. 21 de agosto de 2018: las versiones de desarrollo alpha incluyen importaciones editadas para Python 3. El código fuente cambia para utilizar nombres de módulos de Python 3 en la mayor parte de los casos.

source: 4. September 17, 2018: NVDA 2018.3 powered by wxPython 4.0.3 released, with a follow-up release (2018.3.1) 48 hours later, pre-transition workflow officially begins.
es: 4. 17 de septiembre de 2018: se libera NVDA 2018.3 con WXPython 4.0.3, con una versión que le sigue (2018.3.1) 48 horas después. Comienza oficialmente el flujo de trabajo previo a la transición.

source: 5. December 13, 2018: a major pull request that introduces abstract base classes is merged into master branch. This pull request also resolves metaclass syntax problem through use of six module.
es: 5. 13 de diciembre de 2018: se mezcla en la rama master una solicitud importante de cambios que introduce clases base abstractas. Esta solicitud de cambio también resuelve el problema de sintaxis de metaclase mediante el uso del módulo six.

source: 6. December 17, 2018: NVDA 2018.4 stable version released.
es: 6. 17 de diciembre de 2018: liberada la versión estable de NVDA 2018.4.

source: 7. March 26, 2019: NVDA 2019.1 released.
es: 7. 26 de marzo de 2019: liberada la versión estable de NVDA 2019.1.

source: 8. April 26, 2019: placeholder snapshot (Threshold) built to house Python 3 transition and other backwards incompatible changes.
es: 8. 26 de abril de 2019: creación de versión de desarrollo (Threshold) construida para alojar la transición a Python 3 y otros cambios incompatibles con versiones anteriores.

source: 9. June 7, 2019: async keyword fix merged into Threshold.
es: 9. 7 de junio de 2019: la corrección para la palabra clave async se ha mezclado en la rama Threshold.

source: 10. June 24, 2019: major hurdles with Appveyor build process (unit and system tests, signing executables, etc.) resolved.
es: 10. 24 de junio de 2019: los principales obstáculos con el proceso de compilación de Appveyor (pruebas unitarias y del sistema, firma de ejecutables, etc.) se han resuelto.

source: 11. July 15, 2019: Python 3 moves from staging to Threshold integration.
es: 11. 15 de julio de 2019: Python 3 se mueve de staging a threshold.

source: 12. July 25, 2019: Python 3 work comes to master branch, milestone done.
es: 12. 25 de julio de 2019: los trabajos relacionados con Python 3 llegan a la rama master, hito completado.

source: 2. Transition stage 1 (done):
es: 2. Fase 1 de la transición (completada):

source: 1. June 7, 2019: a staging branch for Python 3 transition activated with various source code edits.
es: 1. 7 de junio de 2019: se ha activado una rama temporal con la transición a Python 3 con diversos cambios en el código fuente.

source: 2. June 8, 2019: staging branch building begins.
es: 2. 8 de junio de 2019: comienzan las compilaciones desde la rama transitoria.

source: 3. June 12, 2019: source code compilation became possible.
es: 3. 12 de junio de 2019: ya es posible compilar desde el código fuente.

source: 4. June 13, 2019: parts of binary compilation and testing framework succeeded.
es: 4. 13 de junio de 2019: parte de la compilación binaria y el marco de trabajo de pruebas tienen éxito.

source: 5. June 24, 2019: running NVDA from source and performing system tests became possible.
es: 5. 24 de junio de 2019: ya es posible ejecutar NVDA desde el código fuente y realizar pruebas del sistema.

source: 6. June 26, 2019: first binary snapshot compiled (not ready for the general public).
es: 6. 26 de junio de 2019: compilada la primera versión binaria de desarrollo (no está preparada para el público general).

source: 7. July 15, 2019: started testing with Threshold work.
es: 7. 15 de julio de 2019: se inician las pruebas con los trabajos en Threshold.

source: 8. July 25, 2019: alpha snapshot powered by Python 3 compiled, milestone done.
es: 8. 25 de julio de 2019: se compiló una versión de desarrollo Alpha de NVDA con Python 3 incorporado, hito alcanzado.

source: 3. Transition stage 2 (done):
es: 3. Fase 2 de la transición (completada):

source: 1. July 26, 2019: community invitation to test Python 3 work.
es: 1. 26 de julio de 2019: invitación para que la comunidad pruebe el trabajo con Python 3.

source: 2. August 14, 2019: NVDA 2019.2, one of the last Python 2 versions, released.
es: 2. 14 de agosto de 2019: se publica NVDA 2019.2, una de las últimas versiones compatibles con Python 2.

source: 3. December 9, 2019: NVDA 2019.3 beta 1 released.
es: 3. 9 de diciembre de 2019: liberada la beta 1 de NVDA 2019.3.

source: 4. March 9, 2020: NVDA 2019.3 released.
es: 4. 9 de marzo de 2020: se libera NVDA 2019.3.

source: 4. After transition: done.
es: 4. Después de la transición: completado.

source: 5. Python 3 native features:
es: 5. Características nativas de Python 3:

source: * Asyncio: not important at this stage.
es: * Asyncio: no es importante en esta fase.

source: * Collections.ChainMap: eases implementation of config.ConfigManager.
es: * Collections.ChainMap: facilita la implementación de config.ConfigManager.

source: * pyz: no impact unless use cases emerge.
es: * pyz: no tiene impacto a menos que aparezcan casos de uso.

source: * Formatted string literals (the "f" strings): eases string debugging and more readable messages.
es: * Literales de cadenas formateadas (las cadenas "f"): facilita la depuración de cadenas y hace más legibles los mensajes.

source: * Gettext.pgettext (Python 3.8): long sought answer to message contexts (see GitHub issue 1524 for details).
es: * Gettext.pgettext (Python 3.8): la respuesta buscada durante tanto tiempo para los contextos de un mensaje (mira la incidencia 1524 de GitHub para más detalles).

source: * Assignment expression (the ":=" operator in Python 3.8): may allow improved readability of some if and while statements.
es: * Expresión de asignación (el operador := en Python 3.8): puede permitir una lectura mejorada de algunas instrucciones if y while.

source: * sys.breakpointhook: allow Visual Studio debugger and friends to help debug NVDA (if installed).
es: * sys.breakpointhook: ayuda al depurador de Visual Studio y compañía a depurar NVDA (si está instalado).

source: * Enum: may improve certain listings including roles list in control types.
es: * Enum: puede mejorar ciertas listas, incluyendo la lista de roles en los tipos de control.

source: ## Notes for various audiences
es: ## Notas para diversas audiencias

source: ### For code contributors:
es: ### Para colaboradores de código:

source: * Document potential and actual issues when working with Python 3, including changed modules, attribute name changes, internal changes and so on.
es: * Documenta problemas reales y potenciales al trabajar con Python 3, incluyendo módulos cambiados, cambios en nombres de atributos, cambios internos y demás.

source: * When importing a built-in Python module, use try/except when importing modules.
es: * Al importar un módulo incorporado en Python, debes usar try / except mientras se importa.

source: * Try importing Python 2 names as Python 3 name, switching to Python 3 version when Python 2 module is not found or renamed.
es: * Intenta importar el nombre Python 2 como nombre Python 3, cambiando a la versión de Python 3 cuando el módulo de Python 2 haya sido renombrado o no se encuentre.

source: * See NVDA source code for implementation steps.
es: * Mira el código fuente de NVDA para ver los pasos de la implementación.

source: * This is for work prior to transition. During transition, Python 3 import should be attempted first.
es: * Esto se hace para el trabajo previo a la transición. Durante la transición, se debería intentar primero la importación con Python 3.

source: * Issues should be labeled as "python 3".
es: * Se deben etiquetar las incidencias con la etiqueta "Python 3" en GitHub.

source: * Pull requests should be based on master branch unless specified by lead developers.
es: * Las solicitudes de cambio deberían estar basadas en la rama master a menos que los desarrolladores principales especifiquen lo contrario.

source: * Try using branch name of the form "py3*" where "*" denotes Python 3 feature e.g. py3socketserver for changes to socket server module.
es: * Intenta usar un nombre de rama de la forma "py3*", donde "*" indique una característica de Python 3. Por ejemplo, py3socketserver para cambios en el módulo del servidor de sockets.

source: * If working with built-in Python modules, be sure to test your code via Python 2.7 and 3.7 interpreter before making changes to NVDA source code.
es: * Si trabajas con módulos Python incorporados, asegúrate de probar tu código con los intérpretes Python 2.7 y 3.7 antes de hacer cambios al código fuente de NVDA.

source: * Create a standalone script that'll use features from Python 2 and/or 3.
es: * Crea un script independiente que use funciones de Python 2 y 3.

source: * After testing this script and if it works in Python 3, make changes to NVDA source code and add comments regarding differences between Python 2 and 3.
es: * Después de probar este script y si funciona en Python 3, haz cambios al código fuente de NVDA y añade comentarios relacionados con las diferencias entre Python 2 y 3.

source: * Source code should target both Python 2 and 3 unless the pull request is submitted during active transition period.
es: * El código fuente debería funcionar en Python 2 y 3 a menos que la solicitud de cambio se envíe durante el periodo de transición activo.

source: * Edit this page whenever major changes are committed to master branch or pull request is merged, including import changes and such.
es: * Edita esta página cada vez que se envíen cambios importantes a la rama master o se mezcle una solicitud de cambios, incluyendo cambios de importación y otros.

source: ### For add-on developers:
es: ### Para desarrolladores de complementos:

source: * Try using Python modules that are known to be compatible with both Python 2 and 3.
es: * Intenta usar módulos Python que se sepa que son compatibles con Python 2 y 3.

source: * Be sure to test add-ons in 2019.3 alpha and edit add-on files accordingly.
es: * Asegúrate de probar los complementos en 2019.3 Alpha y edita los archivos del complemento según corresponda.

source: * Make sure to communicate status of Python 3 compatibility for add-ons if possible.
es: * Asegúrate de comunicar el estado de compatibilidad con Python 3 de los complementos si es posible.

source: ### For testers:
es: ### Para evaluadores:

source: * Use a portable copy of 2019.3 alpha if you rely on add-ons not ported to Python 3 yet.
es: * Usa una copia portable de 2019.3 Alpha si necesitas apoyarte en complementos que todavía no han migrado a Python 3.

source: * Contact add-on authors if add-ons do not work in 2019.3 alpha.
es: * Contacta con los autores de complementos si los complementos no funcionan en 2019.3 alpha.

source: ### For translators:
es: ### Para traductores:

source: Nothing yet.
es: Nada todavía.

source: ### For users:
es: ### Para usuarios:

source: nothing yet.
es: nada todavía.

source: ### For organizations:
es: ### Para organizaciones:

source: * Stay informed on Python 3 transition workflow.
es: * Permanece informado sobre el flujo de trabajo de la transición a Python 3.

source: ### For Python community:
es: ### Para la comunidad Python:

source: * During pre-transition period, please help NVDA project spot potential issues with Python 3 transition so they can be noted.
es: * Durante el periodo previo a la transición, por favor ayudad al proyecto NVDA a detectar problemas potenciales con la transición a Python 3 para que puedan documentarse.

source: * During transition, please help write and test Python 3 code and provide additional comments.
es: * Durante la transición, por favor ayudad a escribir y probar código en Python 3 y proporcionad comentarios adicionales.

source: * During post-transition, please help NV Access review transition work, as well as suggest Python 3 features NVDA should adopt,
es: * Durante la fase posterior a la transición, ayuda a NV Access a revisar los trabajos de transición, y sugiere funciones de Python 3 que NVDA debería adoptar,
