Repository: jmdaweb/devguides_translation
Catalog: translations/*/LC_MESSAGES/nvdaPy3.po
Languages: es

source: NOTE: as of 2021, this document is part of the wiki for historical reasons and to serve as a reference for Python upgrades.
es: Nota: desde 2021, este documento es parte de la wiki por motivos históricos y para servir como referencia en actualizaciones de Python.

source: This document outlines rationale and steps for moving NVDA from Python 2.7 to 3.7.
es: Este documento describe los pasos y motivos por los que NVDA se mueve de Python 2.7 a 3.7.

source: ## Background
es: ## Introducción

source: Python is one of the popular programming languages for various projects. Its ease of learning, extensive standard library modules and third-party extensions, as well as extensive documentation and clear syntax makes it an ideal choice for scripting.
es: Python es uno de los lenguajes de programación más populares para diversos proyectos. Es fácil de aprender, tiene muchísimos módulos en su biblioteca estándar y extensiones de terceros, así como una documentación muy completa y una sintaxis clara. Todo esto hace que sea la opción ideal a la hora de elaborar scripts.

source: Currently there are two major branches of Python: 2.x, released in early 2000's, and 3.x, first released in 2008. At first glance, Python 3 may seem similar to Python 2, but there are numerous deeper differences which break backwards compatibility with code written for Python 2. These including extensive Unicode support in Python 3, module renames, changes to imports, changes to division, and many more.
es: Actualmente hay dos ramas principales en Python: 2.x, liberada a principios del año 2000, y 3.x, liberada por primera vez en 2008. A primera vista, Python 3 puede parecer similar a Python 2, pero hay numerosas diferencias profundas, incluyendo el soporte extenso de Unicode en Python 3, módulos renombrados, cambios en las importaciones, cambios en las divisiones y más.

source: ## Rationale
es: ## Motivos

source: When NVDA began in 2006, it used python 2.4. Over the years, NVDA and its add-ons were written in Python 2.7. Support for Python 2.7 is ending, it will no longer receive updates (performance, security, or bug fixes). For this reason, the longevity of NVDA depends on moving to Python 3.
es: Cuando NVDA comenzó en 2006, usaba Python 2.4. Con el paso de los años, NVDA y sus complementos se han escrito en Python 2.7. El soporte para Python 2.7 se acaba, ya no recibirá actualizaciones (rendimiento, seguridad o corrección de fallos). Por este motivo, la longevidad de NVDA depende de migrar a Python 3.

source: ## Getting started
es: ## Para comenzar

source: Learn more about differences between Python 2 and 3, some resources:
es: Aprende más sobre las diferencias entre Python 2 y 3 con estos recursos:

source: Install Python 3.7 32-bit.
es: Instala Python 3.7 de 32 bits.

source: ### Needed dependencies:
es: ### Dependencias necesarias:

source: Most Python dependencies can be installed via PIP while running as a module in Python 3.7 like so:
es: La mayoría de dependencias Python se pueden instalar mediante pip mientras se ejecuta como un módulo en Python 3 de la siguiente manera:

source: `py -3 -m pip install dependencyName`
es: `py -3 -m pip install nombreDeDependencia`

source: The above will work if Python Launcher is installed and the only Python 3 installed is 3.7 32-bit.
es: Lo anterior funcionará si Python launcher está instalado y la única versión de Python 3 disponible es la 3.7 de 32 bits.

source: Before installing any dependencies listed below, be sure to install Python 3.7 32-bit. Dependencies marked "mandatory" must be installed.
es: Antes de instalar cualquier dependencia de las listadas a continuación, asegúrate de instalar Python 3.7 de 32 bits. Se deben instalar aquellas dependencias marcadas como "obligatoria".

source: * Python 3.7.x 32-bit (mandatory)
es: * Python 3.7.x de 32 bits (obligatoria)

source: * Visual Studio 2017 (Community, Professional, Enterprise) (mandatory)
es: * Visual Studio 2017 (Community, Professional, Enterprise) (obligatoria)

source: * Windows 10 SDK (build 17763) (mandatory)
es: * Windows 10 SDK (compilación 17763) (obligatoria)

source: * wxPython 4.0.3 for Python 3.7 (mandatory for GUI and other crucial subsystems)
es: * wxPython 4.0.3 para Python 3.7 (obligatoria para la interfaz gráfica y otros subsistemas cruciales)

source: * Six 1.11.0 (mandatory)
es: * Six 1.11.0 (obligatoria)

source: * SCons 3.0.1 (mandatory)
es: * SCons 3.0.1 (obligatoria)

source: * comtypes 1.1.7 (mandatory)
es: * comtypes 1.1.7 (obligatoria)

source: * Pywin32 extensions build 223 for Python 3.7 (optional)
es: * Extensiones Pywin32, compilación 223 para Python 3.7 (opcional)

source: * pyserial for Python 3.7 (mandatory for debugging braille displays)
es: * pyserial para Python 3.7 (obligatoria para depurar pantallas braille)

source: * Configobj 5.1.0 (mandatory)
es: * Configobj 5.1.0 (obligatoria)

source: * Any other dependencies advertising support for Python 2.x in one package or a separate release for Python 3.x
es: * Cualquier otra dependencia anunciando soporte para Python 2.x en un paquete o con una versión distinta para Python 3.x

source: ### Running Python 3 version of NVDA
es: ### Ejecución de la versión de NVDA para Python 3

source: Once Python 3.7 and dependencies are installed, provided that DLL's are compiled and the version of NVDA in source code form complies with Python 3, run the Python 3 NVDA from Command Prompt or Windows PowerShell as follows:
es: Una vez esté instalado Python 3.7 junto con las dependencias, asumiendo que las dlls están compiladas y la versión del código fuente de NVDA cumple con Python 3, ejecuta NVDA para Python 3 desde el símbolo del sistema o Windows PowerShell de la siguiente manera:

source: 1. Change to the root directory of NVDA's source code.
es: 1. Cambia al directorio raíz del código fuente de NVDA.

source: 2. Then type one of the following:
es: 2. Después teclea una de las siguientes órdenes:

source: * Only Python 3.7 32-bit is installed: `py -3 source/nvda.pyw`
es: * Si sólo está instalado Python 3.7 de 32 bits: `py -3 source/nvda.pyw`

source: * Python 3.7 32-bit and 64-bit are installed: `py -3-32 source/nvda.pyw`
es: * Si tanto Python 3.7 de 32 como de 64 bits están instalados: `py -3-32 source/nvda.pyw`

source: * A different Python 3.x version is installed: `py -3.7-32 source/nvda.pyw`
es: * Hay una versión diferente de Python 3.x instalada: `py -3.7-32 source/nvda.pyw`

source: ### Debugging Python 3 transition work
es: ### Depuración del trabajo de transición a Python 3

source: There are two ways of debugging Python 3 transition workflow:
es: Hay dos formas de depurar el flujo de trabajo de transición a Python 3:

source: 1. Post-mortem (NVDA crashes at startup or wish to view debug information at your leisure): read nvda.log located at "source" directory.
es: 1. Post-mortem (NVDA falla al iniciarse o deseas ver la información de depuración a voluntad): lee el archivo nvda.log que se encuentra en el directorio "source".

source: 2. Interactive (testing an idea or find out how Python 3 modules work): Python Console can be used. Note that not all error messages will be printed to the console but can be found in the log.
es: 2. Consola (para probar una idea o descubrir cómo funcionan los módulos de Python 3): se puede usar la consola Python. Ten en cuenta que no todos los mensajes de error se imprimirán en la consola, pero se pueden encontrar en el registro.

source: ## Transition workflow
es: ## Flujo de trabajo para la transición

source: The following is an overview of Python 2 to 3 transition for NVDA screen reader. Note that information below can change without notice.
es: La siguiente es una descripción general de la transición del lector de pantalla NVDA desde Python 2 a Python 3. Ten en cuenta que la información que hay a continuación puede cambiar sin aviso previo.

source: ### Notable issues and solutions:
es: ### Problemas destacables y soluciones:

source: * Renamed modules:
es: * Módulos renombrados:

source: - Examples:
es: - Ejemplos:

source: - For certain modules (especially those written in C), make sure new modules won't break functionality.
es: - Para ciertos módulos (especialmente aquellos escritos en C), asegurarse de que los nuevos módulos no rompen la funcionalidad.

source: - For at least one case (Espeak NG speech synthesizer), a Python module is imported but never used.
es: - En al menos un caso (sintetizador de voz Espeak NG), se importa un módulo Python pero nunca se usa.

source: * Reorganized modules in Python 3:
es: * Módulos reorganizados en Python 3:

source: - Try loading specific attributes from reorganized modules.
es: - Intentar cargar atributos específicos de los módulos reorganizados.

source: * Absolute versus relative imports:
es: * Importaciones absolutas frente a relativas:

source: - Especially when aliasing is involved (using 'from moduleName import *", observed mostly in app modules).
es: - Especialmente cuando hay alias implicados (importaciones de la forma 'from módulo import *', observadas mayoritariamente en módulos de aplicación).

source: - Use relative imports of the form `from .moduleName import attributeName`
es: - Usar importaciones relativas de la forma `from .módulo import atributo`

source: * Replacement of some private attributes of logging module.
es: * Reemplazados algunos atributos del módulo logging.

source: - These should be changed on a case-by-case basis.
es: - Deberían cambiarse caso por caso.

source: * Inability to print a meaningful log text to log file.
es: * Incapacidad de imprimir un texto significativo de registro al archivo de registro.

source: - Investigate streaming/file handler/redirection issue.
es: - Investigar flujo / manejador de archivos / problema de redirección.

source: * Use of "async" in Python 3:
es: * Uso de "async" en Python 3:

source: - Which affects `nvwave.playWaveFile(async=True)` as this raises syntax error.
es: - Que afecta a `nvwave.playWaveFile(async=True)` elevando un error de sintaxis.

source: - Rename the keyword to "asynchronous"
es: - Renombrar la palabra clave a "asynchronous".

source: * Division differences (`/` versus `//`):
es: * Diferencias en la división (`/` frente a `//`):

source: - manipulating mouse cursor.
es: - Manipular el cursor del ratón.

source: - Standardize around floor division (`//`) for integer values, regular division (`/`) for floats.
es: - Estandarizar la división redondeando a la baja (`//`) para enteros, división regular (`/`) para números reales.

source: * Bytes versus strings:
es: * Bytes frente a cadenas:

source: - caused by encoding, or in some cases, mandated by DLL's where ANSI characters are expected.
es: - Causado por la codificación, o en algunos casos, obligatorio para las dlls que esperan caracteres ANSI.

source: - Try unifying under Unicode as much as possible.
es: - Intentar unificar bajo Unicode tanto como sea posible.

source: - This is pronounced when working with C functions (Espeak DLL, for example) where ANSI strings are expected by C functions but Python prefers Unicode.
es: - Esto se complica al trabajar con funciones en C (la dll de Espeak, por ejemplo), donde esperan cadenas ANSI pero Python las envía como Unicode.

source: * Removed and incompatible modules
es: * Módulos eliminados e incompatibles

source: - EG:
es: - Ejemplo:

source: - Either find a Python 3 equivalent, or use built-in Python features.
es: - Encontrar un equivalente en Python 3, o usar las características incorporadas en Python.

source: - Same can be said about dependencies (`txt2tags`, for example)
es: - Se puede decir lo mismo de las dependencias (`txt2tags`, por ejemplo)

source: * Provide `__hash__` method for classes implementing `__eq__` method
es: * Proporciona un método `__hash__` para las clases que implementen el método `__eq__`

source: - This is required due to hash randomization in python 3.3 and later.
es: - Esto es necesario debido a la aleatorización de hashes en Python 3.3 y posterior.

source: - One of the simplest solutions is to use the parent object's `__hash__` method (`__hash__ = parentClass.__hash__`).
es: - Una de las soluciones más simples es usar el método `__hash__` de la clase padre (`__hash__ = clasePadre.__hash__`).

source: * Object methods of the form `_get_property` do not work
es: * Los métodos de objeto que siguen el formato `_get_property` no funcionan

source: - EG when trying to set initial synthesizer, braille display, focus object
es: - Por ejemplo al intentar establecer el sintetizador inicial, la pantalla braille o el objeto con el foco

source: - Caused by metaclass syntax differences between Python 2 and 3.
es: - Causado por las diferencias de sintaxis de metaclase entre Python 2 y 3.

source: - Use metaclass specifier of the form `metaclass=someclass`
es: - Usar el especificador de metaclase de la forma `metaclase=algunaclase`

source: - Resolved in December 2018 (see below)
es: - Resuelto en diciembre de 2018 (mira debajo)

source: * Incompatible dictionary methods.
es: * Métodos de diccionario incompatibles.

source: - `dict.has_key(key)`: use `key in dict`
es: - `dict.has_key(clave)`: usar `clave in dict`

source: - `dict.iter*`: use attributes directly (e.g. `dict.items()` instead of `dict.iteritems()`
es: - `dict.iter*`: usar atributos directamente (por ejemplo, usar `dict.items()` en vez de `dict.iteritems()`)

source: - Certain code fragments expect a list, so wrap the iterator call inside a list constructor
es: - Ciertos fragmentos de código esperan una lista, por lo que se envuelve la llamada al iterador dentro de un constructor de lista

source: * No more `unichr`
es: * Ya no existe `unichr`

source: - Standardize around `chr`
es: - Estandarizarse alrededor de `chr`

source: ### Before transition:
es: ### Antes de la transición:

source: Start date: September 17, 2018
es: Fecha de inicio: 17 de septiembre de 2018

source: 1. An NVDA version with wxPython 4 must be released. This is a must, as wxPython 4 supports Python 3, which is a stepping stone for Python 3 transition.
es: 1. Se debe liberar una versión de NVDA que funcione con WXPython 4. Esto es obligatorio, ya que WXPython 4 soporta Python 3, lo que supone un paso en la transición.

source: * Requirement met on September 17, 2018 with release of NVDA 2018.3.
es: * Requisito satisfecho el 17 de septiembre de 2018 con la liberación de NVDA 2018.3.

source: 2. Source code level dependencies must be satisfied. This includes not only wxPython 4, but also ConfigObj, Comtypes, Pyserial, Pywin32 and others.
es: 2. Las dependencias a nivel de código fuente deben satisfacerse. Esto no sólo incluye WXPython 4, sino también ConfigObj, Comtypes, Pyserial, Pywin32 y otras.

source: * Requirement met on June 10, 2019.
es: * Requisito cumplido el 10 de junio de 2019.

source: 3. Transition issues must be researched and documented (see above for known issues and proposed workarounds). Use "python 3" label.
es: 3. Se deben investigar y documentar los problemas de la transición (mira arriba para ver problemas conocidos y soluciones propuestas). Usa la etiqueta "python 3".

source: * As of July 13, 2019, at least 40 issues were identified, along with several pull requests, most of which are resolved.
es: * A fecha de 13 de julio de 2019, se han identificado al menos 40 problemas, que llevan asociadas sus respectivas solicitudes de cambio. La mayoría ya se han resuelto.

source: 4. If needed, create pull requests dealing with pre-transition workflow such as making NVDA source code Python 2 and 3 aware (imports, for instance).
es: 4. Si es necesario,crear solicitudes de cambio que traten con el flujo de trabajo previo a la transición, como por ejemplo hacer que el código fuente sea compatible con Python 2 y 3 (importaciones, por ejemplo).

source: * As of july 13, 2019, at least 30 transition related pull request were submitted and merged into a staging branch.
es: * Con fecha 13 de julio de 2019, se han enviado e integrado al menos 30 solicitudes de cambio relacionadas con la transición en una rama transitoria.

source: 5. Binary dependencies must be satisfied. These include wxPython, Py2exe and others.
es: 5. Se deben satisfacer las dependencias binarias. Estas incluyen WXPython, Py2exe y otras.

source: 6. Tests must run to completion.
es: 6. Las pruebas deben ejecutarse hasta que se completen.

source: * Requirement met on June 26, 2019.
es: * Requisito cumplido el 26 de junio de 2019.

source: 7. Work must move from llimited testing to broad testing.
es: 7. Se debe mover el trabajo de pruebas limitadas a pruebas más extensas.

source: * Requirement met on July 25, 2019.
es: * Requisito cumplido el 25 de julio de 2019.

source: Completed on: July 25, 2019
es: Completado: 25 de julio de 2019

source: ### Transition:
es: ### Transición:

source: This is divided into two stages:
es: Esto se divide en dos fases:

source: 1. Stage 1 (source code changes): NVDA developers will investigate, provide fixes for, and test transition related issues.
es: 1. Fase 1 (cambios al código fuente): los desarrolladores de NVDA investigarán, proporcionarán correcciones y harán pruebas en incidencias relacionadas con la transición.

source: 2. Stage 2 (broad testing): testing beyond NVDA developers when NV Access believes transition work is ready for broad testing.
es: 2. Fase 2 (pruebas generalizadas): pruebas más allá de los desarrolladores de NVDA cuando NV Access crea que los trabajos de transición estén listos para pruebas externas.

source: #### Stage 1: source code changes
es: #### Fase 1: cambios al código fuente

source: Start date: June 8, 2019
es: Fecha de inicio: 8 de junio de 2019

source: 1. A group of developers (code contributors, Python programmers outside of NVDA project and others) should work on transforming NVDA's source code to Python 3.
es: 1. Un grupo de desarrolladores (colaboradores de código, desarrolladores de complementos, programadores Python de fuera del proyecto NVDA y otros) deberían trabajar en transformar el código fuente de NVDA a Python 3.

source: * Do not run 2to3 and tell the script to replace files, as further tweaking is required for some files.
es: * No ejecutar el script 2to3 diciéndole que reemplace archivos, ya que se deben hacer retoques adicionales.

source: * For each transformation iteration, test the source code to make sure features are identical (or almost identical) with older NVDA releases.
es: * Para cada transformación en la iteración, probar el código para asegurarse de que la funcionalidad es idéntica (o casi idéntica) a la de versiones de NVDA antiguas.

source: 2. Issues related to transition must be documented.
es: 2. Se deben documentar las incidencias relativas a la transición.

source: * Issues must be labeled as "Python 3" in GitHub.
es: * Se deben etiquetar las incidencias con la etiqueta "Python 3" en GitHub.

source: * If needed, proposed solutions and workarounds should be documented in the issue tracker.
es: * Si es necesario, se deben documentar las soluciones propuestas en el sistema de incidencias.

source: 3. Source code developers must test NVDA to make sure no major issues are encountered while working on python 3 transition. During this phase, binary builds will not be released until the below condition is met.
es: 3. Los desarrolladores del código fuente deben probar NVDA para asegurarse de que no se encuentran problemas importantes mientras se trabaja en la transición a Python 3. Durante esta fase, no se liberarán versiones binarias hasta que se cumpla la siguiente condición.

source: * Gather dependencies and make sure they are compatible with Python 3.
es: * Recopilar dependencias y asegurarse de que son compatibles con Python 3.

source: * Try running SCons under Python 3 to make sure source code is prepared.
es: * Intentar ejecutar SCons en Python 3 para asegurarse de que el código está preparado.

source: * If features are working, compare it against latest stable NVDA release in hopes of catching regressions.
es: * Si las características funcionan, compararlas con la última versión estable de NVDA con la esperanza de capturar regresiones.

source: 4. A suitable binary distribution packager must be found, tested, and documented. A series of binary builds must be created to make sure the combination of NVDA's own python 3 code, dependencies, binary packagers, and others work seamlessly.
es: 4. Se debe encontrar un empaquetador de distribución binaria adecuado, probarlo y documentarlo. Debe crearse una serie de compilaciones binarias para asegurarse de que la combinación de NVDA codificado en Python 3, las dependencias, los empaquetadores binarios y demás funcionan bien juntos.

source: * Originally, Py2exe was considered, but it does not support Python 3.7.
es: * Originalmente se pensó en Py2exe, pero no soporta Python 3.7.

source: * A promising alternative is cx_freeze.
es: * cx_freeze es una alternativa prometedora.

source: * A Python 3 version of Py2exe that supports Python 3.7 was found.
es: * Se ha encontrado una versión de Py2exe que soporta Python 3.7.

source: 5. Appveyor build must finish to completion.
es: 5. La compilación de Appveyor debe finalizar para completar.

source: * As of june 15, 2019, source code, launcher, and certain tests are working.
es: * A fecha del 15 de junio de 2019, tanto el código fuente como el lanzador y ciertas pruebas funcionan.

source: * As of june 26, 2019, Appveyor build runs to completion.
es: * A fecha de 26 de junio de 2019, la compilación de Appveyor se ejecuta hasta completarse.

source: 6. Master branch must contain Python 3 work.
es: 6. La rama master debe contener el trabajo en Python 3.

source: * As of July 15, 2019, Python 3 work has moved from a staging branch to Project Threshold main branch.
es: * A fecha de 15 de julio de 2019, el trabajo de Python 3 se ha movido de una rama transitoria a la rama principal del proyecto Threshold.

source: * As of July 25, 2019, Python 3 powers master branch.
es: * A fecha de 25 de julio de 2019, Python 3 se encuentra en la rama master.

source: #### Stage 2: broad testing
es: #### Fase 2: pruebas generalizadas

source: Start date: July 25, 2019
es: Fecha de inicio: 25 de julio de 2019

source: 1. Members of the public should be invited to test a series of try builds meant to test transition work, test add-ons, documentation purposes, community outreach and other steps.
es: 1. Se debería invitar a los miembros del público a que prueben una serie de compilaciones de prueba hechas para comprobar el trabajo de la transición, probar complementos, documentar, extender a la comunidad y otros.

source: 2. Add-ons community and other stakeholders must be given guidance regarding Python 3 transition.
es: 2. La comunidad de complementos y otros miembros deben recibir asistencia relacionada con la transición a Python 3.

source: 3. Add-on developers are asked to start porting their add-ons to Python 3.
es: 3. Se solicita a los desarrolladores de complementos que migren su código a Python 3.

source: Completed on: March 9, 2020
es: Completado: 9 de marzo de 2020

source: ### After transition:
es: ### Después de la transición:

source: Start date: March 9, 2020
es: Fecha de inicio: 9 de marzo de 2020

source: 1. A beta of NVDA powered by python 3 must be released.
es: 1. Se debe liberar una beta de NVDA que funcione con Python 3.

source: 2. Members of the public should provide beta-level feedback.
es: 2. Los miembros del público deberían proporcionar comentarios a nivel de beta.

source: 3. Add-on developers are asked to provide notices regarding python 3 to users.
es: 3. Se solicita a los desarrolladores de complementos que proporcionen a los usuarios avisos sobre Python 3.
