Repository: jmdaweb/devguides_translation
Catalog: translations/*/LC_MESSAGES/StartingTranslationFreeze.po
Languages: es

source: # Starting a Translatable String Freeze
es: # Cómo iniciar una congelación de cadenas traducibles

source: Three weeks before the release is due (two weeks before rc1), beta should enter a translatable string freeze. These instructions are for the release manager and document the process for beginning this freeze.
es: Tres semanas antes de que se libere la versión final (2 semanas antes de la rc1), la rama beta debería entrar en un estado de congelación de cadenas traducibles. Estas instrucciones son para el administrador de versiones y documentan el proceso para iniciar esta congelación.

source: * If you haven't already, make any final corrections to the What's New and add a release blurb.
es: * Si no lo has hecho todavía, haz las correcciones finales necesarias al documento qué hay de nuevo y añade el número de versión correspondiente.

source: * If there have been any changes in beta since the last automated merge to srt (Friday 00:05 AEST), translations should be merged to srt manually:
es: * Si ha habido cambios en beta desde la última mezcla automática en srt (viernes a las 00:05 AEST) se deben mezclar las traducciones en srt manualmente:

source: 1. Log into exbi and su to nvdal10n; e.g. `sudo su - nvdal10n`
es: 1. Inicia sesión en exbi y cambia al usuario nvdal10n; por ejemplo `sudo su - nvdal10n`

source: 3. Run: `mr up`
es: 3. Ejecuta: `mr up`

source: 5. Run: `mr up`
es: 5. Ejecuta: `mr up`

source: 6. Run: `mr mergePot`
es: 6. Ejecuta: `mr mergePot`

source: 7. Run: `mr findRevs`
es: 7. Ejecuta: `mr findRevs`

source: * Announce the freeze on the nvda-devel and nvda-translations email lists. Use the example below as a base, ensuring you edit all instances of the version number and dates:
es: * Anuncia la congelación en las listas de correo nvda-devel y nvda-translations. Apóyate en el ejemplo que hay debajo, modificando según corresponda el número de versión y las fechas:

source: > Subject: Translatable string freeze for NVDA 2017.2
es: > Asunto: Translatable string freeze for NVDA 2017.2

source: * On translations mailing list, right after sending string freeze email, log onto groups.io web interface using the membership account for the release manager and create a calendar event with the following settings:
es: * En la lista de correo de traducciones, justo después de enviar el correo de congelación de cadenas, inicia sesión en la interfaz web de groups.io utilizando la cuenta del miembro administrador de liberaciones y crea un evento de calendario con los siguientes ajustes:

source: * Date: date listed above, use UTC as time zone. Set the same value for start and end dates and times.
es: * Date: la fecha listada más arriba, usa UTC como zona horaria. Pon los mismos valores de fecha y hora en las fechas de inicio y fin.

source: * Organizer: name of the release manager.
es: * Organizer: nombre del administrador de liberaciones.

source: * Organizer email: release manager email address
es: * Organizer email: dirección de correo del administrador de liberaciones

source: * Description: string freeze message above
es: * Description: mensaje anterior de congelación de cadenas

source: * Reminder: at least three for 7 days, 3 days, and 1 day prior to end of string freeze, respectively.
es: * Reminder: al menos tres siete días, tres días y un día antes de la finalización de la congelación, respectivamente.

source: * Send a notice when the event occurs: yes
es: * Send a notice when the event occurs: sí

source: * Send as special notice: yes
es: * Send as special notice: sí

source: * Once the details are correct, create an event and also invite the group.
es: * Una vez sean correctos los detalles, crea un evento e invita también al grupo.
